{
  "tecnologia": "Docker",
  "total_preguntas": 20,
  "preguntas": [
    {
      "id": 1,
      "pregunta": "¿Qué es Docker?",
      "nivel": "básico",
      "opciones": [
        "Una plataforma de contenedorización",
        "Un sistema operativo",
        "Una base de datos",
        "Un lenguaje de programación"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Docker es una <strong>plataforma de contenedorización</strong> que permite empaquetar aplicaciones y sus dependencias en contenedores ligeros y portables. Utiliza la virtualización a nivel de sistema operativo para crear entornos aislados que pueden ejecutarse de manera consistente en cualquier sistema que tenga Docker instalado."
    },
    {
      "id": 2,
      "pregunta": "¿Cuáles son las ventajas principales de usar Docker?",
      "nivel": "básico",
      "opciones": [
        "Portabilidad",
        "Aislamiento",
        "Escalabilidad",
        "Consistencia entre entornos",
        "Virtualización completa de hardware"
      ],
      "respuestas_correctas": [4],
      "explicacion": "Docker ofrece <strong>portabilidad</strong>, <strong>aislamiento</strong>, <strong>escalabilidad</strong> y <strong>consistencia</strong> entre entornos. La <strong>virtualización completa de hardware</strong> no es una ventaja de Docker; Docker usa contenedores a nivel de sistema operativo, no hipervisores."
    },
    {
      "id": 3,
      "pregunta": "¿Qué es un contenedor Docker?",
      "nivel": "básico",
      "opciones": [
        "Una instancia ejecutable de una imagen",
        "Un archivo de configuración",
        "Una máquina virtual",
        "Un repositorio de código"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Un contenedor Docker es una <strong>instancia ejecutable de una imagen</strong>. Es un proceso aislado que incluye todo lo necesario para ejecutar una aplicación: código, runtime, herramientas del sistema, bibliotecas y configuraciones. A diferencia de las VMs, los contenedores comparten el kernel del sistema operativo host."
    },
    {
      "id": 4,
      "pregunta": "¿Qué es una imagen Docker?",
      "nivel": "básico",
      "opciones": [
        "Una plantilla de solo lectura para crear contenedores",
        "Un contenedor en ejecución",
        "Un archivo de logs",
        "Una configuración de red"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Una imagen Docker es una <strong>plantilla de solo lectura</strong> que contiene las instrucciones para crear un contenedor. Se construye usando un Dockerfile y está compuesta por capas (layers) que se apilan para formar el sistema de archivos final. Las imágenes son inmutables y se pueden compartir a través de registries como Docker Hub."
    },
    {
      "id": 5,
      "pregunta": "¿Qué comando se usa para ejecutar un contenedor Docker?",
      "nivel": "básico",
      "opciones": [
        "docker run",
        "docker start",
        "docker execute",
        "docker launch"
      ],
      "respuestas_correctas": [0],
      "explicacion": "El comando <strong>docker run</strong> se usa para crear y ejecutar un nuevo contenedor desde una imagen. Combina las operaciones de crear un contenedor (docker create) e iniciarlo (docker start). Acepta múltiples opciones como -d (detached), -p (port mapping), -v (volumes), --name (nombre del contenedor), etc."
    },
    {
      "id": 6,
      "pregunta": "¿Qué es un Dockerfile?",
      "nivel": "intermedio",
      "opciones": [
        "Un archivo de texto con instrucciones para construir una imagen",
        "Un contenedor en ejecución",
        "Una configuración de red",
        "Un archivo de logs"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Un <strong>Dockerfile</strong> es un <strong>archivo de texto con instrucciones</strong> que define cómo construir una imagen Docker. Contiene comandos secuenciales que Docker ejecuta automáticamente para crear capas de la imagen. Es la receta que especifica el sistema operativo base, dependencias, código de aplicación, configuraciones y comandos de ejecución."
    },
    {
      "id": 7,
      "pregunta": "¿Cuál de las siguientes NO es una instrucción válida en un Dockerfile?",
      "nivel": "intermedio",
      "opciones": [
        "FROM",
        "RUN",
        "COPY",
        "EXPOSE",
        "LAUNCH"
      ],
      "respuestas_correctas": [4],
      "explicacion": "Instrucciones válidas incluyen <strong>FROM</strong>, <strong>RUN</strong>, <strong>COPY</strong> y <strong>EXPOSE</strong>. <strong>LAUNCH</strong> no existe en Dockerfile; el comando por defecto se define con <strong>CMD</strong> o <strong>ENTRYPOINT</strong>."
    },
    {
      "id": 8,
      "pregunta": "¿Qué comando construye una imagen desde un Dockerfile?",
      "nivel": "intermedio",
      "opciones": [
        "docker build",
        "docker create",
        "docker make",
        "docker construct"
      ],
      "respuestas_correctas": [0],
      "explicacion": "El comando <strong>docker build</strong> construye una imagen Docker desde un Dockerfile. Sintaxis típica: 'docker build -t nombre:tag .'. El punto (.) indica el contexto de build (directorio actual). Opciones útiles incluyen -f (especificar Dockerfile), --no-cache (build sin cache), y --build-arg (argumentos de build)."
    },
    {
      "id": 9,
      "pregunta": "¿Qué es Docker Hub?",
      "nivel": "básico",
      "opciones": [
        "Un registro público de imágenes Docker",
        "Una herramienta de orquestación",
        "Un sistema operativo",
        "Una base de datos"
      ],
      "respuestas_correctas": [0],
      "explicacion": "<strong>Docker Hub</strong> es el <strong>registro público de imágenes Docker</strong> más grande del mundo. Permite almacenar, compartir y descargar imágenes Docker. Ofrece repositorios públicos gratuitos, repositorios privados (de pago), builds automatizados desde GitHub/Bitbucket, y webhooks. Es el registry por defecto cuando usas 'docker pull' sin especificar otro."
    },
    {
      "id": 10,
      "pregunta": "¿Cuál de los siguientes comandos NO gestiona imágenes Docker?",
      "nivel": "intermedio",
      "opciones": [
        "docker images",
        "docker pull",
        "docker push",
        "docker rmi",
        "docker exec"
      ],
      "respuestas_correctas": [4],
      "explicacion": "<strong>docker images</strong>, <strong>pull</strong>, <strong>push</strong>, <strong>rmi</strong> y <strong>tag</strong> sí gestionan imágenes. <strong>docker exec</strong> ejecuta comandos dentro de contenedores en ejecución y no gestiona imágenes."
    },
    {
      "id": 11,
      "pregunta": "¿Qué es un volumen en Docker?",
      "nivel": "intermedio",
      "opciones": [
        "Un mecanismo para persistir datos",
        "Un tipo de contenedor",
        "Una configuración de red",
        "Un archivo de logs"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Un volumen en Docker es un <strong>mecanismo para persistir datos</strong> generados y utilizados por contenedores. Los volúmenes existen independientemente del ciclo de vida del contenedor, permitiendo que los datos sobrevivan cuando el contenedor se elimina. Son gestionados por Docker y proporcionan mejor rendimiento que bind mounts en algunos casos."
    },
    {
      "id": 12,
      "pregunta": "¿Cuáles son los tipos de volúmenes en Docker?",
      "nivel": "intermedio",
      "opciones": [
        "Named volumes",
        "Bind mounts",
        "tmpfs mounts",
        "Anonymous volumes"
      ],
      "respuestas_correctas": [0, 1, 2, 3],
      "explicacion": "Docker ofrece varios tipos de almacenamiento: <strong>Named volumes</strong> (gestionados por Docker con nombre), <strong>Bind mounts</strong> (mapeo directo a directorio del host), <strong>tmpfs mounts</strong> (almacenamiento temporal en memoria), y <strong>Anonymous volumes</strong> (volúmenes sin nombre gestionados por Docker). Cada tipo tiene casos de uso específicos según las necesidades de persistencia y rendimiento."
    },
    {
      "id": 13,
      "pregunta": "¿Qué es Docker Compose?",
      "nivel": "intermedio",
      "opciones": [
        "Una herramienta para definir aplicaciones multi-contenedor",
        "Un tipo de imagen",
        "Un comando de Docker",
        "Un sistema de monitoreo"
      ],
      "respuestas_correctas": [0],
      "explicacion": "<strong>Docker Compose</strong> es una <strong>herramienta para definir y ejecutar aplicaciones multi-contenedor</strong>. Utiliza un archivo YAML para configurar servicios, redes y volúmenes de la aplicación. Con un solo comando (docker-compose up) puede crear e iniciar todos los servicios definidos, facilitando el desarrollo y deployment de aplicaciones complejas."
    },
    {
      "id": 14,
      "pregunta": "¿Qué archivo usa Docker Compose para su configuración?",
      "nivel": "intermedio",
      "opciones": [
        "docker-compose.yml",
        "Dockerfile",
        "compose.json",
        "docker.config"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Docker Compose utiliza el archivo <strong>docker-compose.yml</strong> (o .yaml) para su configuración. Este archivo YAML define servicios, redes, volúmenes y otras configuraciones necesarias para la aplicación multi-contenedor. También puede usar archivos adicionales como docker-compose.override.yml para sobrescribir configuraciones en diferentes entornos."
    },
    {
      "id": 15,
      "pregunta": "¿Qué es una red Docker?",
      "nivel": "avanzado",
      "opciones": [
        "Un mecanismo para conectar contenedores",
        "Un tipo de volumen",
        "Una imagen especial",
        "Un archivo de configuración"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Una red Docker es un <strong>mecanismo para conectar contenedores</strong> entre sí y con el mundo exterior. Proporciona aislamiento de red, comunicación segura entre contenedores, resolución de nombres DNS automática, y control de tráfico. Permite que los contenedores se comuniquen de manera controlada y segura."
    },
    {
      "id": 16,
      "pregunta": "¿Cuál de los siguientes NO es un tipo de red en Docker?",
      "nivel": "avanzado",
      "opciones": [
        "bridge",
        "host",
        "overlay",
        "macvlan",
        "lan"
      ],
      "respuestas_correctas": [4],
      "explicacion": "Tipos válidos incluyen <strong>bridge</strong>, <strong>host</strong>, <strong>overlay</strong>, <strong>macvlan</strong> y <strong>none</strong>. <strong>lan</strong> no es un tipo de red definido por Docker."
    },
    {
      "id": 17,
      "pregunta": "¿Qué es multi-stage build en Docker?",
      "nivel": "avanzado",
      "opciones": [
        "Una técnica para optimizar el tamaño de imágenes",
        "Un tipo de contenedor",
        "Una configuración de red",
        "Un comando especial"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Un <strong>multi-stage build</strong> es una <strong>técnica para optimizar el tamaño de imágenes</strong> usando múltiples declaraciones FROM en un solo Dockerfile. Permite usar diferentes imágenes base para diferentes etapas del build, copiando solo los artefactos necesarios a la imagen final. Esto resulta en imágenes más pequeñas y seguras, eliminando herramientas de build y dependencias innecesarias del resultado final."
    },
    {
      "id": 18,
      "pregunta": "¿Qué son los health checks en Docker?",
      "nivel": "avanzado",
      "opciones": [
        "Verificaciones del estado de salud de contenedores",
        "Comandos de limpieza",
        "Configuraciones de red",
        "Tipos de volúmenes"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Los <strong>health checks</strong> son <strong>verificaciones del estado de salud de contenedores</strong> que determinan si la aplicación dentro del contenedor está funcionando correctamente. Se definen con la instrucción HEALTHCHECK en el Dockerfile o con el flag --health-cmd. Docker ejecuta periódicamente este comando y marca el contenedor como healthy, unhealthy o starting según el resultado."
    },
    {
      "id": 19,
      "pregunta": "¿Qué es Docker Registry?",
      "nivel": "avanzado",
      "opciones": [
        "Un servicio para almacenar y distribuir imágenes",
        "Un tipo de contenedor",
        "Una herramienta de monitoreo",
        "Un sistema operativo"
      ],
      "respuestas_correctas": [0],
      "explicacion": "<strong>Docker Registry</strong> es un <strong>servicio para almacenar y distribuir imágenes Docker</strong>. Actúa como un repositorio centralizado donde se pueden subir (push) y descargar (pull) imágenes. Docker Hub es el registry público más conocido, pero también se pueden crear registries privados para uso interno de organizaciones, proporcionando control de acceso y seguridad adicional."
    },
    {
      "id": 20,
      "pregunta": "¿Cuál de las siguientes NO ayuda a optimizar imágenes Docker?",
      "nivel": "avanzado",
      "opciones": [
        "Usar imágenes base mínimas",
        "Multi-stage builds",
        "Minimizar capas",
        "Usar .dockerignore",
        "Mantener archivos temporales"
      ],
      "respuestas_correctas": [4],
      "explicacion": "Optimizar imágenes implica <strong>usar imágenes base mínimas</strong>, <strong>multi-stage builds</strong>, <strong>minimizar capas</strong> y <strong>usar .dockerignore</strong>. <strong>Mantener archivos temporales</strong> aumenta el tamaño y no ayuda a optimizar. Además conviene limpiar caches y paquetes innecesarios."
    }
  ]
}