{
  "tecnologia": "Docker Swarm",
  "total_preguntas": 20,
  "preguntas": [
    {
      "id": 1,
      "pregunta": "¿Qué es Docker Swarm?",
      "nivel": "básico",
      "opciones": [
        "Una herramienta de orquestación nativa de Docker",
        "Un tipo de contenedor",
        "Una imagen de Docker",
        "Un comando de Docker"
      ],
      "respuestas_correctas": [0],
      "explicacion": "<strong>Docker Swarm</strong> es una <strong>herramienta de orquestación nativa de Docker</strong> que permite crear y gestionar un cluster de nodos Docker. Convierte múltiples hosts Docker en un solo host virtual, proporcionando alta disponibilidad, escalabilidad automática, load balancing, y gestión declarativa de servicios. Es más simple que Kubernetes pero menos potente."
    },
    {
      "id": 2,
      "pregunta": "¿Cuál de los siguientes NO es un componente principal de Docker Swarm?",
      "nivel": "básico",
      "opciones": [
        "Manager nodes",
        "Worker nodes",
        "Services",
        "Tasks",
        "Pods"
      ],
      "respuestas_correctas": [4],
      "explicacion": "Los componentes principales son <strong>Manager nodes</strong>, <strong>Worker nodes</strong>, <strong>Services</strong> y <strong>Tasks</strong>. <strong>Pods</strong> es un concepto de Kubernetes, no de Docker Swarm."
    },
    {
      "id": 3,
      "pregunta": "¿Qué comando inicializa un Docker Swarm?",
      "nivel": "básico",
      "opciones": [
        "docker swarm init",
        "docker init swarm",
        "docker create swarm",
        "docker start swarm"
      ],
      "respuestas_correctas": [0],
      "explicacion": "El comando <strong>docker swarm init</strong> inicializa un nuevo cluster Docker Swarm. Este comando convierte el nodo actual en el primer manager node del cluster, genera tokens de unión para otros nodos, y configura la red overlay por defecto. Opcionalmente se puede especificar la IP de advertise con --advertise-addr."
    },
    {
      "id": 4,
      "pregunta": "¿Qué comando se usa para unir un nodo al swarm?",
      "nivel": "básico",
      "opciones": [
        "docker swarm join",
        "docker join swarm",
        "docker node join",
        "docker add node"
      ],
      "respuestas_correctas": [0],
      "explicacion": "El comando <strong>docker swarm join</strong> se usa para unir un nodo al cluster Swarm existente. Requiere un token de unión (obtenido con 'docker swarm join-token') y la dirección del manager. Dependiendo del token usado, el nodo se unirá como manager o worker. Ejemplo: docker swarm join --token TOKEN IP:PORT."
    },
    {
      "id": 5,
      "pregunta": "¿Cuál afirmación NO describe correctamente los roles de manager y worker?",
      "nivel": "básico",
      "opciones": [
        "Manager nodes gestionan el cluster",
        "Worker nodes ejecutan tareas",
        "Manager nodes pueden ejecutar tareas también",
        "Worker nodes pueden tomar decisiones de orquestación"
      ],
      "respuestas_correctas": [3],
      "explicacion": "<strong>Managers</strong> gestionan el cluster y pueden ejecutar tareas; <strong>workers</strong> ejecutan tareas pero <strong>no toman decisiones de orquestación</strong>. Por eso es incorrecto decir que los workers pueden orquestar."
    },
    {
      "id": 6,
      "pregunta": "¿Qué es un service en Docker Swarm?",
      "nivel": "intermedio",
      "opciones": [
        "Una definición de cómo ejecutar contenedores en el cluster",
        "Un tipo de contenedor",
        "Una imagen específica",
        "Un comando de Docker"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Un <strong>service</strong> en Docker Swarm es una <strong>definición de cómo ejecutar contenedores en el cluster</strong>. Especifica la imagen, número de réplicas, recursos, redes, volúmenes, y constraints de placement. Los services son declarativos: defines el estado deseado y Swarm se encarga de mantenerlo, creando y destruyendo tasks según sea necesario."
    },
    {
      "id": 7,
      "pregunta": "¿Cuál de los siguientes NO es un comando válido para gestionar services en Swarm?",
      "nivel": "intermedio",
      "opciones": [
        "docker service create",
        "docker service ls",
        "docker service update",
        "docker service delete",
        "docker service rm"
      ],
      "respuestas_correctas": [3],
      "explicacion": "Los comandos válidos incluyen <strong>docker service create</strong>, <strong>ls</strong>, <strong>update</strong> y <strong>rm</strong>. <strong>docker service delete</strong> no existe; la eliminación se realiza con <code>docker service rm</code>."
    },
    {
      "id": 8,
      "pregunta": "¿Qué son las tasks en Docker Swarm?",
      "nivel": "intermedio",
      "opciones": [
        "Instancias individuales de contenedores ejecutándose",
        "Comandos de gestión",
        "Tipos de nodos",
        "Configuraciones de red"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Las <strong>tasks</strong> son <strong>instancias individuales de contenedores ejecutándose</strong> como parte de un service. Cada task representa una unidad atómica de trabajo que incluye el contenedor y su configuración. Los manager nodes asignan tasks a worker nodes, y cada task tiene un estado (running, failed, complete, etc.). Son inmutables: si fallan, se crean nuevas tasks."
    },
    {
      "id": 9,
      "pregunta": "¿Cuál de los siguientes SÍ es un modo de deployment de un service?",
      "nivel": "intermedio",
      "opciones": [
        "Singleton",
        "Global (una instancia por nodo)",
        "Distributed",
        "Stateful"
      ],
      "respuestas_correctas": [1],
      "explicacion": "Swarm soporta dos modos: <strong>Replicated</strong> y <strong>Global</strong>. Entre las opciones, <strong>Global</strong> es un modo válido; 'Singleton', 'Distributed' y 'Stateful' no son modos de deployment en Swarm."
    },
    {
      "id": 10,
      "pregunta": "¿Qué comando muestra información de los nodos?",
      "nivel": "intermedio",
      "opciones": [
        "docker node ls",
        "docker swarm nodes",
        "docker list nodes",
        "docker show nodes"
      ],
      "respuestas_correctas": [0],
      "explicacion": "El comando <strong>docker node ls</strong> muestra información de todos los nodos en el cluster Swarm. Proporciona detalles como ID del nodo, hostname, status (Ready/Down), availability (Active/Pause/Drain), rol (Manager/Worker), y versión del Engine. Solo puede ejecutarse desde un manager node."
    },
    {
      "id": 11,
      "pregunta": "¿Cuál de los siguientes NO es un tipo de red en Docker Swarm?",
      "nivel": "intermedio",
      "opciones": [
        "Overlay networks",
        "Bridge networks",
        "Host networks",
        "Ingress network",
        "Calico network"
      ],
      "respuestas_correctas": [4],
      "explicacion": "Swarm incluye <strong>overlay</strong>, <strong>bridge</strong>, <strong>host</strong> e <strong>ingress</strong>. <strong>Calico</strong> es una solución de CNI común en Kubernetes, no un tipo de red propio de Swarm."
    },
    {
      "id": 12,
      "pregunta": "¿Qué es el load balancing en Docker Swarm?",
      "nivel": "avanzado",
      "opciones": [
        "Distribución automática de tráfico entre réplicas",
        "Un tipo de red",
        "Una configuración de nodo",
        "Un comando específico"
      ],
      "respuestas_correctas": [0],
      "explicacion": "El load balancing en Docker Swarm es la <strong>distribución automática de tráfico entre réplicas</strong> de un service. Swarm proporciona load balancing interno (entre tasks del mismo service) y externo (routing mesh para tráfico entrante). Utiliza IPVS (IP Virtual Server) y permite que cualquier nodo del cluster reciba tráfico para cualquier service publicado."
    },
    {
      "id": 13,
      "pregunta": "¿Cuál de las siguientes NO es una estrategia de actualización en services de Swarm?",
      "nivel": "avanzado",
      "opciones": [
        "Rolling updates",
        "Blue-green deployment",
        "Canary deployment",
        "Recreate",
        "A/B testing"
      ],
      "respuestas_correctas": [4],
      "explicacion": "Las estrategias válidas incluyen <strong>rolling</strong>, <strong>blue-green</strong>, <strong>canary</strong> y <strong>recreate</strong>. <strong>A/B testing</strong> está orientado a experimentación de producto, no es una estrategia de actualización de services en Swarm."
    },
    {
      "id": 14,
      "pregunta": "¿Qué son los secrets en Docker Swarm?",
      "nivel": "avanzado",
      "opciones": [
        "Datos sensibles gestionados de forma segura",
        "Tipos de contenedores",
        "Configuraciones de red",
        "Comandos especiales"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Los <strong>secrets</strong> son <strong>datos sensibles gestionados de forma segura</strong> en Docker Swarm (passwords, certificados, claves API). Se almacenan encriptados en el Raft log, se transmiten encriptados por TLS, y se montan como archivos en memoria (tmpfs) en los contenedores. Solo son accesibles por services autorizados y nunca se escriben al disco."
    },
    {
      "id": 15,
      "pregunta": "¿Cuál de los siguientes NO es un comando para gestionar secrets en Swarm?",
      "nivel": "avanzado",
      "opciones": [
        "docker secret create",
        "docker secret ls",
        "docker secret rm",
        "docker secret inspect",
        "docker secret edit"
      ],
      "respuestas_correctas": [4],
      "explicacion": "La gestión de secrets se realiza con <strong>create</strong>, <strong>ls</strong>, <strong>rm</strong> e <strong>inspect</strong>. No existe <code>docker secret edit</code>; para actualizar un secret se recrea y se referencia la nueva versión."
    },
    {
      "id": 16,
      "pregunta": "¿Qué son los configs en Docker Swarm?",
      "nivel": "avanzado",
      "opciones": [
        "Archivos de configuración no sensibles",
        "Tipos de servicios",
        "Configuraciones de nodos",
        "Comandos de gestión"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Los <strong>configs</strong> son <strong>archivos de configuración no sensibles</strong> gestionados por Docker Swarm. A diferencia de los secrets, no se encriptan y pueden ser leídos por cualquier service autorizado. Se usan para archivos de configuración de aplicaciones, scripts, certificados públicos, etc. Se montan como archivos en el sistema de archivos del contenedor."
    },
    {
      "id": 17,
      "pregunta": "¿Cuál de los siguientes NO contribuye a alta disponibilidad en Swarm?",
      "nivel": "avanzado",
      "opciones": [
        "Múltiples manager nodes",
        "Quorum para decisiones",
        "Failover automático",
        "Raft consensus algorithm",
        "Un solo manager sin replicación"
      ],
      "respuestas_correctas": [4],
      "explicacion": "Para alta disponibilidad se requieren <strong>múltiples managers</strong> y <strong>quorum</strong> utilizando <strong>Raft</strong>, con <strong>failover</strong> automático. Un solo manager sin replicación no provee HA."
    },
    {
      "id": 18,
      "pregunta": "¿Qué son las constraints en services?",
      "nivel": "avanzado",
      "opciones": [
        "Restricciones para placement de contenedores",
        "Límites de recursos",
        "Configuraciones de red",
        "Tipos de volúmenes"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Las <strong>constraints</strong> son <strong>restricciones para placement de contenedores</strong> que determinan en qué nodos pueden ejecutarse las tasks. Se definen con --constraint y pueden basarse en labels de nodos (node.labels.type==database), roles (node.role==worker), o características del nodo. Permiten control granular sobre la distribución de workloads."
    },
    {
      "id": 19,
      "pregunta": "¿Cuál de los siguientes NO ayuda directamente al troubleshooting en Swarm?",
      "nivel": "avanzado",
      "opciones": [
        "docker service logs",
        "docker node inspect",
        "docker service ps",
        "docker swarm ca",
        "docker image prune"
      ],
      "respuestas_correctas": [4],
      "explicacion": "Para troubleshooting se usan <strong>service logs</strong>, <strong>node inspect</strong>, <strong>service ps</strong> y <strong>swarm ca</strong>. <strong>docker image prune</strong> limpia imágenes y espacio, pero no aporta diagnóstico directo."
    },
    {
      "id": 20,
      "pregunta": "¿Cuál de las siguientes NO es una buena práctica recomendada para Docker Swarm?",
      "nivel": "avanzado",
      "opciones": [
        "Usar número impar de managers",
        "Separar managers de workers en producción",
        "Implementar monitoreo y logging",
        "Publicar todos los services en host network sin restricciones",
        "Usar health checks en services"
      ],
      "respuestas_correctas": [3],
      "explicacion": "Buenas prácticas incluyen managers impares, separación de roles, observabilidad y health checks. <strong>Publicar todo en host network sin restricciones</strong> no es recomendable por seguridad y aislamiento."
    }
  ]
}