{
  "tecnologia": "OpenShift",
  "total_preguntas": 20,
  "preguntas": [
    {
      "id": 1,
      "pregunta": "¿Qué es Red Hat OpenShift?",
      "nivel": "básico",
      "opciones": [
        "Una plataforma de contenedores empresarial basada en Kubernetes",
        "Un sistema operativo",
        "Una base de datos",
        "Un lenguaje de programación"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Red Hat OpenShift es <strong>una plataforma de contenedores empresarial basada en Kubernetes</strong> que proporciona herramientas adicionales para desarrollo, despliegue y gestión de aplicaciones. Incluye características empresariales como seguridad mejorada, interfaz web completa, registro de imágenes integrado, herramientas de CI/CD, y soporte comercial de Red Hat."
    },
    {
      "id": 2,
      "pregunta": "¿Cuál de las siguientes afirmaciones NO describe una diferencia de OpenShift respecto a Kubernetes vanilla?",
      "nivel": "básico",
      "opciones": [
        "OpenShift incluye herramientas adicionales de desarrollo",
        "OpenShift tiene seguridad reforzada por defecto (SCC/RBAC)",
        "OpenShift integra un registro interno de imágenes",
        "OpenShift sustituye etcd por MySQL como datastore"
      ],
      "respuestas_correctas": [3],
      "explicacion": "La afirmación incorrecta es que OpenShift <strong>sustituye etcd por MySQL</strong>. OpenShift sigue usando <strong>etcd</strong> como datastore principal, y sí se diferencia por <strong>herramientas de desarrollo</strong>, <strong>seguridad reforzada</strong> y <strong>registro interno</strong>."
    },
    {
      "id": 3,
      "pregunta": "¿Qué es un Project en OpenShift?",
      "nivel": "básico",
      "opciones": [
        "Un namespace de Kubernetes con funcionalidades adicionales",
        "Un tipo de contenedor",
        "Una imagen de Docker",
        "Un comando específico"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Un Project en OpenShift es <strong>un namespace de Kubernetes con funcionalidades adicionales</strong> que proporciona aislamiento de recursos y control de acceso. Incluye características como cuotas de recursos, políticas de red, RBAC específico del proyecto, y herramientas de colaboración. Es la unidad básica de organización para equipos y aplicaciones."
    },
    {
      "id": 4,
      "pregunta": "¿Cuál de los siguientes NO es un componente principal de OpenShift?",
      "nivel": "básico",
      "opciones": [
        "Master nodes",
        "Worker nodes",
        "etcd",
        "Active Directory",
        "Router"
      ],
      "respuestas_correctas": [3],
      "explicacion": "<strong>Active Directory</strong> no es un componente de OpenShift. Los componentes principales incluyen <strong>master/worker nodes</strong>, <strong>etcd</strong>, <strong>router</strong> y el <strong>registro de imágenes</strong>."
    },
    {
      "id": 5,
      "pregunta": "¿Qué comando se usa para hacer login en OpenShift CLI?",
      "nivel": "básico",
      "opciones": [
        "oc login",
        "openshift login",
        "kubectl login",
        "os login"
      ],
      "respuestas_correctas": [0],
      "explicacion": "El comando <strong>oc login</strong> se usa para autenticarse en un cluster OpenShift desde la línea de comandos. Puede usarse con URL del servidor, token, o credenciales de usuario. Ejemplo: 'oc login https://api.cluster.com:6443' o 'oc login --token=TOKEN'. Una vez autenticado, se pueden ejecutar comandos oc para gestionar recursos."
    },
    {
      "id": 6,
      "pregunta": "¿Qué es un BuildConfig en OpenShift?",
      "nivel": "intermedio",
      "opciones": [
        "Una definición de cómo construir imágenes de contenedor",
        "Una configuración de red",
        "Un tipo de servicio",
        "Una configuración de almacenamiento"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Un BuildConfig es <strong>una definición de cómo construir imágenes de contenedor</strong> en OpenShift. Especifica la estrategia de build (S2I, Docker, Custom), el código fuente, la imagen base, triggers para iniciar builds, y configuraciones de salida. Automatiza el proceso de construcción de imágenes desde código fuente hasta imagen lista para desplegar."
    },
    {
      "id": 7,
      "pregunta": "¿Cuál de las siguientes NO es una build strategy soportada en OpenShift?",
      "nivel": "intermedio",
      "opciones": [
        "Source-to-Image (S2I)",
        "Docker build",
        "Custom build",
        "GitHub Actions build"
      ],
      "respuestas_correctas": [3],
      "explicacion": "<strong>GitHub Actions</strong> es una plataforma de CI/CD externa, no una build strategy nativa de OpenShift. OpenShift soporta <strong>S2I</strong>, <strong>Docker</strong> y <strong>Custom</strong>; los pipelines se orquestan con Jenkins/tekton según la versión."
    },
    {
      "id": 8,
      "pregunta": "¿Qué es Source-to-Image (S2I)?",
      "nivel": "intermedio",
      "opciones": [
        "Una herramienta para construir imágenes reproducibles",
        "Un tipo de deployment",
        "Una configuración de red",
        "Un comando de OpenShift"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Source-to-Image (S2I) es <strong>una herramienta para construir imágenes reproducibles</strong> que combina código fuente de aplicación con una imagen builder para producir una nueva imagen lista para ejecutar. Proporciona builds rápidos, seguros y reproducibles sin necesidad de Dockerfile. Es especialmente útil para lenguajes como Java, Node.js, Python, etc."
    },
    {
      "id": 9,
      "pregunta": "¿Qué es un DeploymentConfig en OpenShift?",
      "nivel": "intermedio",
      "opciones": [
        "Una definición de cómo desplegar aplicaciones",
        "Una configuración de build",
        "Un tipo de servicio",
        "Una configuración de red"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Un DeploymentConfig es <strong>una definición de cómo desplegar aplicaciones</strong> en OpenShift. Especifica la imagen a desplegar, número de réplicas, estrategia de deployment, triggers automáticos, y configuraciones de rollback. Proporciona capacidades avanzadas como rolling deployments, blue-green deployments, y hooks de lifecycle."
    },
    {
      "id": 10,
      "pregunta": "¿Cuál de los siguientes NO es un comando válido del CLI de OpenShift (oc)?",
      "nivel": "intermedio",
      "opciones": [
        "oc new-app",
        "oc get",
        "oc compose",
        "oc logs",
        "oc exec"
      ],
      "respuestas_correctas": [2],
      "explicacion": "<strong>oc compose</strong> no es un comando válido. Comandos básicos de oc incluyen <strong>new-app</strong>, <strong>get</strong>, <strong>describe</strong>, <strong>logs</strong> y <strong>exec</strong>."
    },
    {
      "id": 11,
      "pregunta": "¿Qué son las Routes en OpenShift?",
      "nivel": "intermedio",
      "opciones": [
        "Objetos que exponen servicios externamente",
        "Configuraciones de red interna",
        "Tipos de contenedores",
        "Comandos de gestión"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Las Routes son <strong>objetos que exponen servicios externamente</strong> proporcionando URLs accesibles desde fuera del cluster. Permiten configurar hostnames personalizados, terminación SSL/TLS, balanceeo de carga, y políticas de tráfico. Son el mecanismo principal para hacer que las aplicaciones sean accesibles desde internet en OpenShift."
    },
    {
      "id": 12,
      "pregunta": "¿Qué es el Image Registry en OpenShift?",
      "nivel": "intermedio",
      "opciones": [
        "Un registro interno para almacenar imágenes de contenedor",
        "Una base de datos",
        "Un tipo de servicio",
        "Una configuración de red"
      ],
      "respuestas_correctas": [0],
      "explicacion": "El Image Registry es <strong>un registro interno para almacenar imágenes de contenedor</strong> integrado en OpenShift. Permite almacenar, gestionar y distribuir imágenes de contenedor dentro del cluster. Proporciona características como autenticación integrada, control de acceso basado en proyectos, y integración con el proceso de build de OpenShift."
    },
    {
      "id": 13,
      "pregunta": "¿Cuál de las siguientes NO es una característica de seguridad en OpenShift?",
      "nivel": "avanzado",
      "opciones": [
        "Security Context Constraints (SCCs)",
        "Role-Based Access Control (RBAC)",
        "Network Policies",
        "Horizontal Pod Autoscaler (HPA)",
        "Image scanning"
      ],
      "respuestas_correctas": [3],
      "explicacion": "<strong>HPA</strong> es una funcionalidad de escalado automático, no una característica de seguridad. OpenShift ofrece <strong>SCCs</strong>, <strong>RBAC</strong>, <strong>Network Policies</strong>, <strong>Pod Security</strong> y <strong>escaneo de imágenes</strong>."
    },
    {
      "id": 14,
      "pregunta": "¿Qué son los Security Context Constraints (SCCs)?",
      "nivel": "avanzado",
      "opciones": [
        "Políticas que controlan las acciones que pueden realizar los pods",
        "Configuraciones de red",
        "Tipos de servicios",
        "Comandos de gestión"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Los Security Context Constraints (SCCs) son <strong>políticas que controlan las acciones que pueden realizar los pods</strong> en OpenShift. Definen qué usuarios pueden ejecutar, qué capacidades tienen, si pueden acceder al sistema de archivos del host, usar volúmenes privilegiados, etc. Proporcionan un control granular sobre la seguridad de los contenedores."
    },
    {
      "id": 15,
      "pregunta": "¿Cuál de los siguientes NO corresponde a un mecanismo de almacenamiento en OpenShift?",
      "nivel": "avanzado",
      "opciones": [
        "Persistent Volumes (PV)",
        "Persistent Volume Claims (PVC)",
        "Storage Classes",
        "ConfigMaps",
        "EmptyDir"
      ],
      "respuestas_correctas": [3],
      "explicacion": "<strong>ConfigMaps</strong> almacenan configuración en texto plano y no son un mecanismo de almacenamiento de datos de aplicación. <strong>PV</strong>, <strong>PVC</strong>, <strong>StorageClasses</strong> y volúmenes como <strong>EmptyDir</strong> sí son mecanismos de almacenamiento."
    },
    {
      "id": 16,
      "pregunta": "¿Qué son los Operators en OpenShift?",
      "nivel": "avanzado",
      "opciones": [
        "Aplicaciones que extienden Kubernetes para gestionar aplicaciones complejas",
        "Tipos de contenedores",
        "Configuraciones de red",
        "Comandos especiales"
      ],
      "respuestas_correctas": [0],
      "explicacion": "Los Operators son <strong>aplicaciones que extienden Kubernetes para gestionar aplicaciones complejas</strong> usando conocimiento específico del dominio. Automatizan tareas operacionales como instalación, configuración, actualizaciones, backups y recuperación. OpenShift incluye muchos operators para bases de datos, middleware y otras aplicaciones empresariales."
    },
    {
      "id": 17,
      "pregunta": "¿Cuál de los siguientes NO es un componente del OpenShift Container Platform?",
      "nivel": "avanzado",
      "opciones": [
        "OpenShift API server",
        "OpenShift Controller Manager",
        "Docker Swarm Manager",
        "OpenShift Registry",
        "OpenShift Web Console"
      ],
      "respuestas_correctas": [2],
      "explicacion": "<strong>Docker Swarm Manager</strong> pertenece a otra plataforma de orquestación y no es parte de OpenShift. OpenShift incluye <strong>API server</strong>, <strong>Controller Manager</strong>, <strong>Router</strong>, <strong>Registry</strong> y <strong>Web Console</strong>."
    },
    {
      "id": 18,
      "pregunta": "¿Qué es el OpenShift Service Mesh?",
      "nivel": "avanzado",
      "opciones": [
        "Una implementación de Istio para OpenShift",
        "Un tipo de red",
        "Una configuración de almacenamiento",
        "Un comando de gestión"
      ],
      "respuestas_correctas": [0],
      "explicacion": "OpenShift Service Mesh es <strong>una implementación de Istio para OpenShift</strong> que proporciona conectividad, seguridad y observabilidad para microservicios. Incluye características como traffic management, security policies, telemetría, y distributed tracing. Facilita la gestión de comunicaciones complejas entre servicios en arquitecturas de microservicios."
    },
    {
      "id": 19,
      "pregunta": "¿Cuál de las siguientes NO es una estrategia de deployment en OpenShift?",
      "nivel": "avanzado",
      "opciones": [
        "Rolling deployment",
        "Recreate deployment",
        "Blue-Green deployment",
        "Canary deployment",
        "A/B testing"
      ],
      "respuestas_correctas": [4],
      "explicacion": "<strong>A/B testing</strong> es una táctica de experimentación/marketing, no una estrategia de deployment en OpenShift. OpenShift soporta <strong>rolling</strong>, <strong>recreate</strong>, <strong>blue-green</strong> y <strong>canary</strong>."
    },
    {
      "id": 20,
      "pregunta": "¿Cuál de las siguientes NO es una práctica recomendada en OpenShift?",
      "nivel": "avanzado",
      "opciones": [
        "Usar resource quotas y limits",
        "Implementar health checks",
        "Permitir contenedores privilegiados por defecto",
        "Aplicar principio de menor privilegio",
        "Monitorear con Prometheus y Grafana"
      ],
      "respuestas_correctas": [2],
      "explicacion": "<strong>Permitir contenedores privilegiados por defecto</strong> no es una buena práctica. Sí lo son <strong>quotas/limits</strong>, <strong>health checks</strong>, <strong>menor privilegio</strong> y <strong>observabilidad</strong>."
    }
  ]
}